# Chapter 5 - Getting Started with Pandas

pandas will be a major tool of interest throughout much of the rest of the book. It
contains data structures and data manipulation tools designed to make data cleaning
and analysis fast and easy in Python. pandas is often used in tandem with numerical
computing tools like NumPy and SciPy, analytical libraries like statsmodels and
scikit-learn, and data visualization libraries like matplotlib. pandas adopts significant
parts of NumPy’s idiomatic style of array-based computing, especially array-based
functions and a preference for data processing without for loops.

*__While pandas adopts many coding idioms from NumPy, the biggest difference is that
pandas is designed for working with tabular or heterogeneous data. NumPy, by contrast, is best suited for working with homogeneous numerical array data__*.

Since becoming an open source project in 2010, pandas has matured into a quite
large library that’s applicable in a broad set of real-world use cases. The developer
community has grown to over 800 distinct contributors, who’ve been helping build
the project as they’ve used it to solve their day-to-day data problems.

Throughout the rest of the book, I use the following import convention for pandas:

In [1]:
import pandas as pd

Thus, whenever you see pd. in code, it’s referring to pandas. You may also find it eas‐
ier to import Series and DataFrame into the local namespace since they are so fre‐
quently used:

In [2]:
from pandas import Series, DataFrame

## 5.1 Introduction to pandas Data Structures

To get started with pandas, you will need to get comfortable with its two workhorse
data structures: Series and DataFrame. While they are not a universal solution for
every problem, they provide a solid, easy-to-use basis for most applications.

### Series

A Series is a one-dimensional array-like object containing a sequence of values (of
similar types to NumPy types) and an associated array of data labels, called its index.
The simplest Series is formed from only an array of data:

In [3]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
objx = pd.Series([1,2,3])
objx

0    1
1    2
2    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

Often it will be desirable to create a Series with an index identifying each data point
with a label:

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

Compared with NumPy arrays, you can use labels in the index when selecting single
values or a set of values:

In [9]:
obj2['a']

-5

In [10]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2['d']

4

In [13]:
obj2['d'] = 6

In [14]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [15]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [16]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

Here ['c', 'a', 'd'] is interpreted as a list of indices, even though it contains
strings instead of integers.

Using NumPy functions or NumPy-like operations, such as filtering with a boolean
array, scalar multiplication, or applying math functions, will preserve the index-value
link:

In [17]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [18]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [21]:
import numpy as np

In [22]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Another way to think about a Series is as a fixed-length, ordered dict, as it is a map‐
ping of index values to data values. It can be used in many contexts where you might
use a dict:

In [23]:
'b' in obj2

True

In [24]:
'e' in obj2

False

Should you have data contained in a Python dict, you can create a Series from it by
passing the dict:

In [3]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)

In [4]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [27]:
type(obj3)

pandas.core.series.Series

When you are only passing a dict, the index in the resulting Series will have the dict’s
keys in sorted order. You can override this by passing the dict keys in the order you
want them to appear in the resulting Series:

In [5]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [6]:
type(states)

list

Here, three values found in sdata were placed in the appropriate locations, but since
no value for 'California' was found, it appears as NaN (not a number), which is con‐
sidered in pandas to mark missing or NA values. Since 'Utah' was not included in
states, it is excluded from the resulting object.

I will use the terms “missing” or “NA” interchangeably to refer to missing data. The
isnull and notnull functions in pandas should be used to detect missing data:

In [29]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [30]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

Series also has these as instance methods:

In [31]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

I discuss working with missing data in more detail in Chapter 7.

A useful Series feature for many applications is that it automatically aligns by index
label in arithmetic operations:

In [32]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [33]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [34]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Data alignment features will be addressed in more detail later. If you have experience
with databases, you can think about this as being similar to a join operation.

Both the Series object itself and its index have a name attribute, which integrates with
other key areas of pandas functionality:

In [35]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

A Series’s index can be altered in-place by assignment:

In [36]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [37]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

A DataFrame represents a rectangular table of data and contains an ordered collec‐
tion of columns, each of which can be a different value type (numeric, string,
boolean, etc.). The DataFrame has both a row and column index; it can be thought of
as a dict of Series all sharing the same index. Under the hood, the data is stored as one
or more two-dimensional blocks rather than a list, dict, or some other collection of
one-dimensional arrays. The exact details of DataFrame’s internals are outside the
scope of this book.

There are many ways to construct a DataFrame, though one of the most common is
from a dict of equal-length lists or NumPy arrays:

In [38]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

The resulting DataFrame will have its index assigned automatically as with Series, and
the columns are placed in sorted order:

In [39]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

If you are using the Jupyter notebook, pandas DataFrame objects will be displayed as
a more browser-friendly HTML table.

For large DataFrames, the head method selects only the first five rows:

In [40]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

If you specify a sequence of columns, the DataFrame’s columns will be arranged in
that order:

In [41]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

If you pass a column that isn’t contained in the dict, it will appear with missing values
in the result:

In [42]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

In [43]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [44]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

A column in a DataFrame can be retrieved as a Series either by dict-like notation or
by attribute:

In [45]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [46]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [47]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

Note that the returned Series have the same index as the DataFrame, and their name
attribute has been appropriately set.

Rows can also be retrieved by position or name with the special loc attribute (much
more on this later):

In [48]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

Columns can be modified by assignment. For example, the empty 'debt' column
could be assigned a scalar value or an array of values:

In [49]:
frame2['debt'] = 13

In [50]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5    13
two    2001    Ohio  1.7    13
three  2002    Ohio  3.6    13
four   2001  Nevada  2.4    13
five   2002  Nevada  2.9    13
six    2003  Nevada  3.2    13

In [51]:
frame2['debt'] = np.arange(6)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

When you are assigning lists or arrays to a column, the value’s length must match the
length of the DataFrame. If you assign a Series, its labels will be realigned exactly to
the DataFrame’s index, inserting missing values in any holes:

In [52]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [53]:
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

Assigning a column that doesn’t exist will create a new column. The del keyword will
delete columns as with a dict.

As an example of del, I first add a new column of boolean values where the state
column equals 'Ohio':

In [54]:
frame2['eastern'] = frame2.state == 'Ohio'

In [55]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

The del method can then be used to remove this column:

In [57]:
del frame2['eastern']

In [58]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

Another common form of data is a nested dict of dicts:

In [59]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

If the nested dict is passed to the DataFrame, pandas will interpret the outer dict keys
as the columns and the inner keys as the row indices:

In [60]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

You can transpose the DataFrame (swap rows and columns) with similar syntax to a
NumPy array:

In [61]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

The keys in the inner dicts are combined and sorted to form the index in the result.
This isn’t true if an explicit index is specified:

In [62]:
pd.DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

Dicts of Series are treated in much the same way:

In [66]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}
print(pdata)

{'Ohio': 2000    1.5
2001    1.7
Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
2001    2.4
Name: Nevada, dtype: float64}

In [65]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

For a complete list of things you can pass the DataFrame constructor, see Table 5-1.

![](dataframe.jpg)

If a DataFrame’s index and columns have their name attributes set, these will also be
displayed:

In [67]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [68]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

As with Series, the values attribute returns the data contained in the DataFrame as a
two-dimensional ndarray:

In [69]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

If the DataFrame’s columns are different dtypes, the dtype of the values array will be
chosen to accommodate all of the columns:

In [70]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### Index Objects

pandas’s Index objects are responsible for holding the axis labels and other metadata
(like the axis name or names). Any array or other sequence of labels you use when
constructing a Series or DataFrame is internally converted to an Index:

In [71]:
obj = pd.Series(range(3), index=['a','b','c'])
obj

a    0
b    1
c    2
dtype: int64

In [72]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [73]:
index[1:]

Index(['b', 'c'], dtype='object')

Index objects are immutable and thus can’t be modified by the user:

In [74]:
index[1] = 'd'

TypeError: Index does not support mutable operations

Immutability makes it safer to share Index objects among data structures:

In [75]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [76]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [77]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [78]:
obj2.index is labels

True

In addition to being array-like, an Index also behaves like a fixed-size set:

In [79]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [80]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [81]:
'Ohio' in frame3.columns

True

In [82]:
2003 in frame3.index

False

Unlike Python sets, a pandas Index can contain duplicate labels:

In [83]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

Selections with duplicate labels will select all occurrences of that label.

Each Index has a number of methods and properties for set logic, which answer other
common questions about the data it contains. Some useful ones are summarized in
Table 5-2.

![](index.jpg)

## 5.2 Essential Functionality

This section will walk you through the fundamental mechanics of interacting with the
data contained in a Series or DataFrame. In the chapters to come, we will delve more
deeply into data analysis and manipulation topics using pandas. This book is not
intended to serve as exhaustive documentation for the pandas library; instead, we’ll
focus on the most important features, leaving the less common (i.e., more esoteric)
things for you to explore on your own.

### Reindexing

An important method on pandas objects is reindex, which means to create a new
object with the data conformed to a new index. Consider an example:

In [84]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

Calling reindex on this Series rearranges the data according to the new index, intro‐
ducing missing values if any index values were not already present:

In [85]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

For ordered data like time series, it may be desirable to do some interpolation or fill‐
ing of values when reindexing. The method option allows us to do this, using a
method such as ffill, which forward-fills the values:

In [86]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [87]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

With DataFrame, reindex can alter either the (row) index, columns, or both. When
passed only a sequence, it reindexes the rows in the result:

In [91]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index=['a', 'c', 'd'], 
                     columns=['Ohio', 'Texas', 'California'] )
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [89]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

The columns can be reindexed with the columns keyword:

In [92]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [93]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

See Table 5-3 for more about the arguments to reindex.

![](reindex.jpg)

As we’ll explore in more detail, you can reindex more succinctly by label-indexing
with loc, and many users prefer to use it exclusively:

In [94]:
frame.loc[['a', 'b', 'c', 'd'], states]

C:\Users\Wisnu\Anaconda3\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Dropping Entries from an Axis

Dropping one or more entries from an axis is easy if you already have an index array
or list without those entries. As that can require a bit of munging and set logic, the drop method will return a new object with the indicated value or values deleted from
an axis:

In [95]:
obj = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [96]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [97]:
obj.drop(['c','d'])

a    0
b    1
e    4
dtype: int32

With DataFrame, index values can be deleted from either axis. To illustrate this, we
first create an example DataFrame:

In [98]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index=['Ohio', 'Colorado', 'Utah', 'New York'],
                       columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Calling drop with a sequence of labels will drop values from the row labels (axis 0):

In [99]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

You can drop values from the columns by passing axis=1 or axis='columns':

In [100]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [102]:
data.drop('one', axis=1)

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [103]:
data.drop(['two','three'], axis='columns')

          one  four
Ohio        0     3
Colorado    4     7
Utah        8    11
New York   12    15

Many functions, like drop, which modify the size or shape of a Series or DataFrame,
can manipulate an object in-place without returning a new object:

In [104]:
obj.drop('c', inplace=True)

In [105]:
obj

a    0
b    1
d    3
e    4
dtype: int32

Be careful with the inplace, as it destroys any data that is dropped.

### Indexing, Selection, and Filtering

Series indexing (obj[...]) works analogously to NumPy array indexing, except you
can use the Series’s index values instead of only integers. Here are some examples of
this:

In [106]:
obj = pd.Series(np.arange(4), index=['a', 'b', 'c', 'd'])
obj

a    0
b    1
c    2
d    3
dtype: int32

In [107]:
obj['b']

1

In [108]:
obj[1]

1

In [109]:
obj[2:4]

c    2
d    3
dtype: int32

In [110]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: int32

In [111]:
obj[obj<2]

a    0
b    1
dtype: int32

Slicing with labels behaves differently than normal Python slicing in that the endpoint is inclusive:

In [112]:
obj['b':'c']

b    1
c    2
dtype: int32

Setting using these methods modifies the corresponding section of the Series:

In [113]:
obj['b':'c'] = 5
obj

a    0
b    5
c    5
d    3
dtype: int32

Indexing into a DataFrame is for retrieving one or more columns either with a single
value or sequence:

In [114]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [115]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [117]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

Indexing like this has a few special cases. First, slicing or selecting data with a boolean
array:

In [138]:
data[:3] # All columns, the first 3 rows (skip the last row).

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [137]:
data[1:] #All columns, skip the 1st row.

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [139]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

The row selection syntax data[:2] is provided as a convenience. Passing a single ele‐
ment or a list to the [] operator selects columns.

Another use case is in indexing with a boolean DataFrame, such as one produced by a
scalar comparison:

In [140]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [142]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

This makes DataFrame syntactically more like a two-dimensional NumPy array in
this particular case.

#### Selection with loc and iloc

For DataFrame label-indexing on the rows, I introduce the special indexing operators
loc and iloc. They enable you to select a subset of the rows and columns from a
DataFrame with NumPy-like notation using either axis labels (loc) or integers
(iloc).

As a preliminary example, let’s select a single row and multiple columns by label:

In [143]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [144]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

We’ll then perform some similar selections with integers using iloc:

In [145]:
data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [147]:
data.iloc[2] # Index number 2: Utah.

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [148]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

Both indexing functions work with slices in addition to single labels or lists of labels:

In [160]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [163]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [164]:
data.iloc[:]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [169]:
data.iloc[:,:]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [170]:
data.iloc[:,:2]

          one  two
Ohio        0    0
Colorado    0    5
Utah        8    9
New York   12   13

In [171]:
data.iloc[:,2:]

          three  four
Ohio          0     0
Colorado      6     7
Utah         10    11
New York     14    15

In [172]:
data.iloc[2:,:2]

          one  two
Utah        8    9
New York   12   13

In [173]:
data.iloc[:, :3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [174]:
data.iloc[:, :3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

So there are many ways to select and rearrange the data contained in a pandas object.
For DataFrame, Table 5-4 provides a short summary of many of them. As you’ll see
later, there are a number of additional options for working with hierarchical indexes.

![](index_df1.jpg)

![](index_df2.jpg)

### Integer Indexes

Working with pandas objects indexed by integers is something that often trips up
new users due to some differences with indexing semantics on built-in Python data
structures like lists and tuples. For example, you might not expect the following code
to generate an error:

In [176]:
ser = pd.Series(np.arange(3))
ser

0    0
1    1
2    2
dtype: int32

In [177]:
ser[-1]

KeyError: -1

In this case, pandas could “fall back” on integer indexing, but it’s difficult to do this in
general without introducing subtle bugs. Here we have an index containing 0, 1, 2,
but inferring what the user wants (label-based indexing or position-based) is difficult:

In [178]:
ser

0    0
1    1
2    2
dtype: int32

On the other hand, with a non-integer index, there is no potential for ambiguity:

In [179]:
ser2 = pd.Series(np.arange(3), index=['a', 'b', 'c'])
ser2

a    0
b    1
c    2
dtype: int32

In [180]:
ser2[-1]

2

To keep things consistent, if you have an axis index containing integers, data selection
will always be label-oriented. For more precise handling, use loc (for labels) or iloc
(for integers):

In [181]:
ser[:1]

0    0
dtype: int32

In [182]:
ser.loc[:1]

0    0
1    1
dtype: int32

In [183]:
ser.iloc[:1]

0    0
dtype: int32

### Arithmetic and Data Alignment

An important pandas feature for some applications is the behavior of arithmetic
between objects with different indexes. When you are adding together objects, if any
index pairs are not the same, the respective index in the result will be the union of the
index pairs. For users with database experience, this is similar to an automatic outer
join on the index labels. Let’s look at an example:

In [184]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [185]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

Adding these together yields:

In [186]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

The internal data alignment introduces missing values in the label locations that don’t
overlap. Missing values will then propagate in further arithmetic computations.

In the case of DataFrame, alignment is performed on both the rows and the columns:

In [187]:
df1 = pd.DataFrame(np.arange(9).reshape((3,3)), columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [189]:
df2 = pd.DataFrame(np.arange(12).reshape((4,3)), columns=list('bde'), 
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

Adding these together returns a DataFrame whose index and columns are the unions
of the ones in each DataFrame:

In [190]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

Since the 'c' and 'e' columns are not found in both DataFrame objects, they appear
as all missing in the result. The same holds for the rows whose labels are not common
to both objects.

If you add DataFrame objects with no column or row labels in common, the result
will contain all nulls:

In [191]:
df1 = pd.DataFrame({'A':[1,2]})
df1

   A
0  1
1  2

In [192]:
df2 = pd.DataFrame({'B':[3,4]})
df2

   B
0  3
1  4

In [193]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

In arithmetic operations between differently indexed objects, you might want to fill
with a special value, like 0, when an axis label is found in one object but not the other:

In [194]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [195]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [200]:
df2.loc[1, 'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Adding these together results in NA values in the locations that don’t overlap:

In [201]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

Using the add method on df1, I pass df2 and an argument to fill_value:

In [202]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

See Table 5-5 for a listing of Series and DataFrame methods for arithmetic.

![](arithmetic.jpg)

Each of them has a counterpart, starting with the letter r, that has arguments flipped. So these
two statements are equivalent:

In [203]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [204]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

Relatedly, when reindexing a Series or DataFrame, you can also specify a different fill
value:

In [205]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

As with NumPy arrays of different dimensions, arithmetic between DataFrame and
Series is also defined. First, as a motivating example, consider the difference between
a two-dimensional array and one of its rows:

In [206]:
arr = np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [207]:
arr[0]

array([0, 1, 2, 3])

In [208]:
arr - arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

When we subtract arr[0] from arr, the subtraction is performed once for each row.
This is referred to as broadcasting and is explained in more detail as it relates to gen‐
eral NumPy arrays in Appendix A. Operations between a DataFrame and a Series are
similar:

In [209]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)), columns=list('bde'), 
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [210]:
series = frame.iloc[0]
series

b    0
d    1
e    2
Name: Utah, dtype: int32

By default, arithmetic between DataFrame and Series matches the index of the Series
on the DataFrame’s columns, broadcasting down the rows:

In [211]:
frame-series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

If an index value is not found in either the DataFrame’s columns or the Series’s index,
the objects will be reindexed to form the union:

In [212]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If you want to instead broadcast over the columns, matching on the rows, you have to
use one of the arithmetic methods. For example:

In [213]:
series3 = frame['d']
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int32

In [214]:
frame.sub(series3, axis='index')

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

The axis number that you pass is the axis to match on. In this case we mean to match
on the DataFrame’s row index (axis='index' or axis=0) and broadcast across.

### Function Application and Mapping

NumPy ufuncs (element-wise array methods) also work with pandas objects:

In [216]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.588904 -0.141604  0.245766
Ohio    1.539264  0.204122 -0.395627
Texas  -0.515136 -0.635288 -0.370881
Oregon -0.425961 -1.042614 -0.750985

In [217]:
np.abs(frame)

               b         d         e
Utah    0.588904  0.141604  0.245766
Ohio    1.539264  0.204122  0.395627
Texas   0.515136  0.635288  0.370881
Oregon  0.425961  1.042614  0.750985

Another frequent operation is applying a function on one-dimensional arrays to each
column or row. DataFrame’s apply method does exactly this:

In [218]:
f = lambda x: x.max() - x.min()

In [219]:
frame.apply(f)

b    2.054400
d    1.246736
e    0.996751
dtype: float64

Here the function f, which computes the difference between the maximum and minimum of a Series, is invoked once on each column in frame. The result is a Series hav‐
ing the columns of frame as its index.

If you pass axis='columns' to apply, the function will be invoked once per row
instead:

In [221]:
frame.apply(f, axis='columns')

Utah      0.730507
Ohio      1.934891
Texas     0.264408
Oregon    0.616653
dtype: float64

Many of the most common array statistics (like sum and mean) are DataFrame methods, so using apply is not necessary.

The function passed to apply need not return a scalar value; it can also return a Series
with multiple values:

In [224]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [225]:
frame.apply(f)

            b         d         e
min -0.515136 -1.042614 -0.750985
max  1.539264  0.204122  0.245766

Element-wise Python functions can be used, too. Suppose you wanted to compute a
formatted string from each floating-point value in frame. You can do this with apply
map:

In [226]:
format = lambda x: '%.2f' % x

In [228]:
frame.applymap(format)

            b      d      e
Utah     0.59  -0.14   0.25
Ohio     1.54   0.20  -0.40
Texas   -0.52  -0.64  -0.37
Oregon  -0.43  -1.04  -0.75

The reason for the name applymap is that Series has a map method for applying an
element-wise function:

In [229]:
frame['e'].map(format)

Utah       0.25
Ohio      -0.40
Texas     -0.37
Oregon    -0.75
Name: e, dtype: object

### Sorting and Ranking

Sorting a dataset by some criterion is another important built-in operation. To sort
lexicographically by row or column index, use the sort_index method, which returns
a new, sorted object:

In [230]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [231]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

With a DataFrame, you can sort by index on either axis:

In [232]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index=['three', 'one'], 
        columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [233]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [234]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

The data is sorted in ascending order by default, but can be sorted in descending
order, too:

In [235]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort a Series by its values, use its sort_values method:

In [237]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [238]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Any missing values are sorted to the end of the Series by default:

In [239]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

When sorting a DataFrame, you can use the data in one or more columns as the sort
keys. To do so, pass one or more column names to the by option of sort_values:

In [240]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [241]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

To sort by multiple columns, pass a list of names:

In [242]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Ranking assigns ranks from one through the number of valid data points in an array.
The rank methods for Series and DataFrame are the place to look; by default rank
breaks ties by assigning each group the mean rank:

In [244]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [245]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

Ranks can also be assigned according to the order in which they’re observed in the
data:

In [246]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

Here, instead of using the average rank 6.5 for the entries 0 and 2, they instead have
been set to 6 and 7 because label 0 precedes label 2 in the data.

You can rank in descending order, too:

In [247]:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

See Table 5-6 for a list of tie-breaking methods available.

![](rank.jpg)

DataFrame can compute ranks over the rows or the columns:

In [249]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [250]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

Up until now all of the examples we’ve looked at have had unique axis labels (index
values). While many pandas functions (like reindex) require that the labels be
unique, it’s not mandatory. Let’s consider a small Series with duplicate indices:

In [251]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

The index’s is_unique property can tell you whether its labels are unique or not:

In [252]:
obj.index.is_unique

False

Data selection is one of the main things that behaves differently with duplicates.
Indexing a label with multiple entries returns a Series, while single entries return a
scalar value:

In [253]:
obj['a']

a    0
a    1
dtype: int64

In [254]:
obj['c']

4

This can make your code more complicated, as the output type from indexing can
vary based on whether a label is repeated or not.

The same logic extends to indexing rows in a DataFrame:

In [255]:
df = pd.DataFrame(np.random.randn(4,3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.337757  0.029264 -1.467939
a -0.244522 -0.311155 -0.001459
b  1.256485  0.765760  2.119473
b  1.094959  0.826249  0.489148

In [256]:
df.loc['b']

          0         1         2
b  1.256485  0.765760  2.119473
b  1.094959  0.826249  0.489148

## 5.3 Summarizing and Computing Descriptive Statistics

pandas objects are equipped with a set of common mathematical and statistical meth‐
ods. Most of these fall into the category of reductions or summary statistics, methods
that extract a single value (like the sum or mean) from a Series or a Series of values
from the rows or columns of a DataFrame. Compared with the similar methods
found on NumPy arrays, they have built-in handling for missing data. Consider a
small DataFrame:

In [257]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]], 
                 index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

Calling DataFrame’s sum method returns a Series containing column sums:

In [258]:
df.sum()

one    9.25
two   -5.80
dtype: float64

Passing axis='columns' or axis=1 sums across the columns instead:

In [259]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

NA values are excluded unless the entire slice (row or column in this case) is NA.
This can be disabled with the skipna option:

In [260]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

See Table 5-7 for a list of common options for each reduction method.

![](reduction.jpg)

Some methods, like idxmin and idxmax, return indirect statistics like the index value
where the minimum or maximum values are attained:

In [262]:
df.idxmax()

one    b
two    d
dtype: object

In [264]:
df['one']['b']

7.1

Other methods are accumulations:

In [265]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

Another type of method is neither a reduction nor an accumulation. describe is one
such example, producing multiple summary statistics in one shot:

In [266]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

On non-numeric data, describe produces alternative summary statistics:

In [267]:
obj = pd.Series(['a', 'a', 'b', 'c']*4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [268]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

See Table 5-8 for a full list of summary statistics and related methods.

![](desc_stats.jpg)

### Correlation and Covariance

Some summary statistics, like correlation and covariance, are computed from pairs of
arguments. Let’s consider some DataFrames of stock prices and volumes obtained
from Yahoo! Finance using the add-on pandas-datareader package. If you don’t
have it installed already, it can be obtained via conda or pip:

    conda install pandas-datareader

I use the pandas_datareader module to download some data for a few stock tickers:

In [270]:
conda install pandas-datareader

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

## Package Plan ##

  environment location: C:\Users\Wisnu\Anaconda3

  added / updated specs:
    - pandas-datareader


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    conda-4.8.3                |           py37_0         2.8 MB
    pandas-datareader-0.9.0    |             py_0          72 KB
    ------------------------------------------------------------
                                           Total:         2.9 MB

The following NEW packages will be INSTALLED:

  pandas-datareader  pkgs/main/noarch::pandas-datareader-0.9.0-py_0

The following packages will be UPDATED:

  conda                                       4.7.10-py37_0 --> 4.8.3-py37_0



Downloading and Extracting Packages

pandas-datareader-0. | 72 KB     |            |   0%
pandas-datareader-0. | 72 KB     | ##2        |  22%
pandas-datareader-0. | 72 KB     | ########## | 100%

conda-4.8.3          | 2.8 MB    |            |   0%
conda-4.8.3          | 2.8 MB    | 2          |   2%
conda-4.8.3          | 2.8 MB    | 4          |   5%
conda-4.8.3          | 2.8 MB    | 7          |   8%
conda-4.8.3          | 2.8 MB    | 9          |  10%
conda-4.8.3          | 2.8 MB    | #3         |  13%
conda-4.8.3          | 2.8 MB    | #6         |  16%
conda-4.8.3          | 2.8 MB    | #9         |  20%
conda-4.8.3          | 2.8 MB    | ##3        |  23%
conda-4.8.3          | 2.8 MB    | ##5        |  26%
conda-4.8.3          | 2.8 MB    | ##9        |  30%
conda-4.8.3          | 2.8 MB    | ###3       |  34%
conda-4.8.3          | 2.8 MB    | ###6       |  36%
conda-4.8.3          | 2.8 MB    | ###9       |  39%
conda-4.8.3          | 2.8 MB    | ####2      |  42%
conda-4.8.3          | 2.8 MB    | ####5      |  46%
conda-4.8.3          | 2.8 MB    | ####8      |  49%
conda-4.8.3          | 2.8 MB    | #####2     |  52%
conda-4.8.3          | 2.8 MB    | #####4     |  55%
conda-4.8.3          | 2.8 MB    | #####8     |  58%
conda-4.8.3          | 2.8 MB    | ######1    |  62%
conda-4.8.3          | 2.8 MB    | ######4    |  65%
conda-4.8.3          | 2.8 MB    | ######8    |  68%
conda-4.8.3          | 2.8 MB    | #######1   |  71%
conda-4.8.3          | 2.8 MB    | #######4   |  75%
conda-4.8.3          | 2.8 MB    | #######8   |  78%
conda-4.8.3          | 2.8 MB    | ########1  |  81%
conda-4.8.3          | 2.8 MB    | ########4  |  85%
conda-4.8.3          | 2.8 MB    | ########7  |  88%
conda-4.8.3          | 2.8 MB    | #########  |  91%
conda-4.8.3          | 2.8 MB    | #########4 |  94%
conda-4.8.3          | 2.8 MB    | #########7 |  97%
conda-4.8.3          | 2.8 MB    | ########## | 100%
Preparing transaction: ...working... done
Verifying transaction: ...working... done
Executing transaction: ...working... done

Note: you may need to restart the kernel to use updated packages.

In [271]:
import pandas_datareader.data as web

In [272]:
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [274]:
all_data

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2015-08-10  119.989998  116.529999  116.529999  119.720001   54951600.0
 2015-08-11  118.180000  113.330002  117.809998  113.489998   97082800.0
 2015-08-12  115.419998  109.629997  112.529999  115.239998  101217500.0
 2015-08-13  116.400002  114.540001  116.040001  115.150002   48535800.0
 2015-08-14  116.309998  114.010002  114.320000  115.959999   42929500.0
 2015-08-17  117.650002  115.500000  116.040001  117.160004   40884700.0
 2015-08-18  117.440002  116.010002  116.430000  116.500000   34560700.0
 2015-08-19  116.519997  114.680000  116.099998  115.010002   48286500.0
 2015-08-20  114.349998  111.629997  114.080002  112.650002   68501600.0
 2015-08-21  111.900002  105.650002  110.430000  105.760002  128275500.0
 2015-08-24  108.800003   92.000000   94.870003  103.120003  162206300.0
 2015-08-25  111.110001  103.500000  111.110001  103.739998  103601600.0
 2015-08-26  109.889999  105.050003  107.089996  109.690002   96774600.0
 2015-08-27  113.239998  110.019997  112.230003  112.919998   84616100.0
 2015-08-28  113.309998  111.540001  112.169998  113.290001   53164400.0
 2015-08-31  114.529999  112.000000  112.029999  112.760002   56229300.0
 2015-09-01  111.879997  107.360001  110.150002  107.720001   76845900.0
 2015-09-02  112.339996  109.129997  110.230003  112.339996   61888800.0
 2015-09-03  112.779999  110.040001  112.489998  110.370003   53233900.0
 2015-09-04  110.449997  108.510002  108.970001  109.269997   49996300.0
 2015-09-08  112.559998  110.320000  111.750000  112.309998   54843600.0
 2015-09-09  114.019997  109.769997  113.760002  110.150002   85010800.0
 2015-09-10  113.279999  109.900002  110.269997  112.570000   62892800.0
 2015-09-11  114.209999  111.760002  111.790001  114.209999   49915500.0
 2015-09-14  116.889999  114.860001  116.580002  115.309998   58363400.0
 2015-09-15  116.529999  114.419998  115.930000  116.279999   43341200.0
 2015-09-16  116.540001  115.440002  116.250000  116.410004   37173500.0
 2015-09-17  116.489998  113.720001  115.660004  113.919998   64112600.0
 2015-09-18  114.300003  111.870003  112.209999  113.449997   74285300.0
 2015-09-21  115.370003  113.660004  113.669998  115.209999   50222000.0
 ...                ...         ...         ...         ...          ...
 2020-06-26  365.320007  353.019989  364.410004  353.630005   51314200.0
 2020-06-29  362.170013  351.279999  353.250000  361.779999   32661500.0
 2020-06-30  365.980011  360.000000  360.079987  364.799988   35055800.0
 2020-07-01  367.359985  363.910004  365.119995  364.109985   27684300.0
 2020-07-02  370.470001  363.640015  367.850006  364.109985   28510400.0
 2020-07-06  375.779999  369.869995  370.000000  373.850006   29663900.0
 2020-07-07  378.619995  372.230011  375.410004  372.690002   28106100.0
 2020-07-08  381.500000  376.359985  376.720001  381.369995   29273000.0
 2020-07-09  385.269989  378.690002  385.049988  383.010010   31410700.0
 2020-07-10  383.920013  378.820007  381.339996  383.679993   22564300.0
 2020-07-13  399.820007  381.029999  389.059998  381.910004   47912300.0
 2020-07-14  389.019989  375.510010  379.359985  388.230011   42747300.0
 2020-07-15  396.989990  385.959991  395.959991  390.899994   38299500.0
 2020-07-16  389.619995  383.619995  386.250000  386.089996   27644400.0
 2020-07-17  388.589996  383.359985  387.950012  385.309998   23046700.0
 2020-07-20  394.000000  384.250000  385.670013  393.429993   22579500.0
 2020-07-21  397.000000  386.970001  396.690002  388.000000   25911500.0
 2020-07-22  391.899994  386.410004  386.769989  389.089996   22250400.0
 2020-07-23  388.309998  368.040009  387.989990  371.380005   49251100.0
 2020-07-24  371.880005  356.579987  363.950012  370.459991   46359700.0
 2020-07-27  379.619995  373.920013  374.839996  379.239990   30303500.0
 2020-07-28  378.200012  372.989990  377.470001  373.010010   25906400.0
 2020-07-29  380.920013  374.850006  375.000000  380.160004   22582300.0
 2020-07-30  385.190002  375.070007  376.750000  384.760010   39532500.0
 2020-07-31  425.660004  403.299988  411.540009  425.040009   93584200.0
 2020-08-03  446.549988  431.570007  432.799988  435.750000   77037800.0
 2020-08-04  443.160004  433.549988  436.529999  438.660004   43267900.0
 2020-08-05  441.570007  435.589996  437.510010  440.250000   30498000.0
 2020-08-06  457.649994  439.190002  441.619995  455.609985   50607200.0
 2020-08-07  454.700012  441.170013  452.820007  444.450012   49453300.0

              Adj Close
 Date
 2015-08-10  110.634941
 2015-08-11  104.877724
 2015-08-12  106.494896
 2015-08-13  106.411743
 2015-08-14  107.160263
 2015-08-17  108.269211
 2015-08-18  107.659302
 2015-08-19  106.282379
 2015-08-20  104.101456
 2015-08-21   97.734299
 2015-08-24   95.294647
 2015-08-25   95.867607
 2015-08-26  101.366074
 2015-08-27  104.350983
 2015-08-28  104.692871
 2015-08-31  104.203110
 2015-09-01   99.545570
 2015-09-02  103.814980
 2015-09-03  101.994484
 2015-09-04  100.977966
 2015-09-08  103.787254
 2015-09-09  101.791168
 2015-09-10  104.027512
 2015-09-11  105.543083
 2015-09-14  106.559593
 2015-09-15  107.455994
 2015-09-16  107.576134
 2015-09-17  105.275085
 2015-09-18  104.840744
 2015-09-21  106.467194
 ...                ...
 2020-06-26  352.993561
 2020-06-29  361.128876
 2020-06-30  364.143433
 2020-07-01  363.454681
 2020-07-02  363.454681
 2020-07-06  373.177155
 2020-07-07  372.019257
 2020-07-08  380.683624
 2020-07-09  382.320679
 2020-07-10  382.989471
 2020-07-13  381.222656
 2020-07-14  387.531281
 2020-07-15  390.196472
 2020-07-16  385.395111
 2020-07-17  384.616516
 2020-07-20  392.721924
 2020-07-21  387.301697
 2020-07-22  388.389740
 2020-07-23  370.711609
 2020-07-24  369.793243
 2020-07-27  378.557434
 2020-07-28  372.338684
 2020-07-29  379.475800
 2020-07-30  384.067535
 2020-07-31  424.275024
 2020-08-03  434.965759
 2020-08-04  437.870514
 2020-08-05  439.457642
 2020-08-06  454.790009
 2020-08-07  444.450012

 [1259 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 2015-08-10  157.470001  156.119995  156.770004  156.750000   4613400.0
 2015-08-11  155.990005  154.860001  155.960007  155.509995   3167100.0
 2015-08-12  156.520004  153.949997  154.259995  156.160004   3560300.0
 2015-08-13  156.089996  154.320007  156.059998  155.070007   2533400.0
 2015-08-14  156.210007  154.580002  155.000000  155.750000   3226400.0
 2015-08-17  156.690002  154.699997  155.199997  156.309998   2249600.0
 2015-08-18  156.520004  155.250000  155.509995  156.009995   2018300.0
 2015-08-19  155.669998  153.410004  155.149994  153.940002   4206400.0
 2015-08-20  153.910004  152.500000  152.740005  152.660004   4011500.0
 2015-08-21  153.190002  148.699997  151.500000  148.850006   7362100.0
 2015-08-24  147.759995  143.000000  143.470001  143.470001  10189700.0
 2015-08-25  147.110001  140.619995  146.940002  140.960007   7073200.0
 2015-08-26  146.979996  142.139999  144.089996  146.699997   6221800.0
 2015-08-27  148.970001  145.660004  148.500000  148.539993   4976600.0
 2015-08-28  148.199997  147.179993  147.750000  147.979996   4076300.0
 2015-08-31  148.399994  146.259995  147.380005  147.889999   4093100.0
 2015-09-01  144.979996  141.850006  144.910004  142.679993   5272000.0
 2015-09-02  145.080002  143.179993  144.740005  145.050003   4252000.0
 2015-09-03  148.029999  145.770004  146.050003  146.779999   3603500.0
 2015-09-04  145.399994  143.320007  144.570007  143.699997   4201100.0
 2015-09-08  147.339996  145.660004  145.860001  147.229996   3933300.0
 2015-09-09  149.039993  144.850006  148.740005  145.050003   3407800.0
 2015-09-10  147.160004  144.509995  145.850006  146.199997   3461700.0
 2015-09-11  147.500000  145.669998  145.910004  147.369995   3115100.0
 2015-09-14  147.369995  145.410004  147.369995  145.649994   3226700.0
 2015-09-15  147.929993  145.759995  146.600006  147.529999   2717100.0
 2015-09-16  148.889999  147.539993  147.839996  148.410004   2799200.0
 2015-09-17  149.679993  147.300003  148.100006  148.139999   4003000.0
 2015-09-18  146.389999  143.979996  146.050003  144.509995   7975800.0
 2015-09-21  146.979996  144.919998  145.389999  146.479996   3825000.0
 ...                ...         ...         ...         ...         ...
 2020-06-26  118.989998  116.260002  118.260002  117.190002  10750100.0
 2020-06-29  119.779999  117.370003  117.980003  119.750000   4159500.0
 2020-06-30  121.199997  119.000000  119.190002  120.769997   3919500.0
 2020-07-01  121.230003  118.370003  120.269997  118.540001   4655800.0
 2020-07-02  121.419998  119.260002  119.690002  119.699997   3747000.0
 2020-07-06  121.849998  119.459999  121.250000  120.190002   4045400.0
 2020-07-07  119.510002  117.330002  119.000000  117.580002   4278100.0
 2020-07-08  118.639999  116.480003  118.059998  117.709999   5192800.0
 2020-07-09  118.000000  115.199997  118.000000  115.709999   4763000.0
 2020-07-10  118.570000  115.290001  115.500000  118.349998   4285700.0
 2020-07-13  120.989998  118.660004  119.779999  119.199997   4650700.0
 2020-07-14  120.889999  117.919998  118.620003  120.599998   4534400.0
 2020-07-15  123.959999  122.150002  122.400002  123.000000   4473400.0
 2020-07-16  124.480003  122.160004  122.680000  124.010002   4330900.0
 2020-07-17  125.629997  123.199997  124.389999  125.110001   3984600.0
 2020-07-20  127.070000  125.139999  126.070000  126.370003   9927700.0
 2020-07-21  132.169998  125.800003  131.160004  126.059998  15364900.0
 2020-07-22  129.470001  125.800003  125.900002  128.669998   8195400.0
 2020-07-23  129.369995  127.150002  129.100006  127.330002   4220100.0
 2020-07-24  127.650002  125.500000  126.480003  125.790001   3531100.0
 2020-07-27  126.320000  124.709999  124.860001  126.209999   3733400.0
 2020-07-28  126.339996  124.150002  125.820000  124.470001   4178200.0
 2020-07-29  125.989998  124.070000  124.559998  125.320000   2832800.0
 2020-07-30  123.900002  121.639999  123.709999  122.900002   3988100.0
 2020-07-31  122.989998  121.089996  122.709999  122.940002   5277700.0
 2020-08-03  124.410004  122.150002  123.500000  124.309998   3526100.0
 2020-08-04  125.860001  123.820000  123.820000  125.839996   3466100.0
 2020-08-05  126.750000  124.610001  126.730003  125.449997   3675400.0
 2020-08-06  126.260002  125.000000  125.000000  126.120003   3417100.0
 2020-08-07  125.070000  123.209999  123.500000  124.959999   3651000.0

              Adj Close
 Date
 2015-08-10  125.525490
 2015-08-11  124.532555
 2015-08-12  125.053024
 2015-08-13  124.180183
 2015-08-14  124.724686
 2015-08-17  125.173157
 2015-08-18  124.932915
 2015-08-19  123.275246
 2015-08-20  122.250214
 2015-08-21  119.199188
 2015-08-24  114.890862
 2015-08-25  112.880898
 2015-08-26  117.477425
 2015-08-27  118.950912
 2015-08-28  118.502495
 2015-08-31  118.430397
 2015-09-01  114.258247
 2015-09-02  116.156136
 2015-09-03  117.541512
 2015-09-04  115.075043
 2015-09-08  117.901871
 2015-09-09  116.156136
 2015-09-10  117.077080
 2015-09-11  118.013985
 2015-09-14  116.636604
 2015-09-15  118.142105
 2015-09-16  118.846840
 2015-09-17  118.630623
 2015-09-18  115.723709
 2015-09-21  117.301270
 ...                ...
 2020-06-26  115.675415
 2020-06-29  118.202332
 2020-06-30  119.209145
 2020-07-01  117.007965
 2020-07-02  118.152969
 2020-07-06  118.636642
 2020-07-07  116.060371
 2020-07-08  116.188690
 2020-07-09  114.214539
 2020-07-10  116.820419
 2020-07-13  117.659431
 2020-07-14  119.041344
 2020-07-15  121.410324
 2020-07-16  122.407272
 2020-07-17  123.493057
 2020-07-20  124.736771
 2020-07-21  124.430771
 2020-07-22  127.007042
 2020-07-23  125.684364
 2020-07-24  124.164268
 2020-07-27  124.578835
 2020-07-28  122.861328
 2020-07-29  123.700340
 2020-07-30  121.311615
 2020-07-31  121.351105
 2020-08-03  122.703392
 2020-08-04  124.213615
 2020-08-05  123.828659
 2020-08-06  124.490005
 2020-08-07  124.959999

 [1259 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close      Volume  \
 Date
 2015-08-10   47.490002   46.840000   46.950001   47.330002  23079900.0
 2015-08-11   46.939999   45.900002   46.820000   46.410000  29237400.0
 2015-08-12   46.900002   45.709999   46.189999   46.740002  30181400.0
 2015-08-13   47.099998   46.490002   47.060001   46.730000  22627200.0
 2015-08-14   47.099998   46.520000   46.529999   47.000000  21473400.0
 2015-08-17   47.450001   46.570000   46.810001   47.320000  21099700.0
 2015-08-18   47.430000   46.700001   46.840000   47.270000  23574100.0
 2015-08-19   47.080002   46.299999   46.779999   46.610001  31485500.0
 2015-08-20   46.470001   45.660000   46.070000   45.660000  36238200.0
 2015-08-21   45.480000   43.070000   45.299999   43.070000  70053100.0
 2015-08-24   42.689999   39.720001   40.450001   41.680000  88753700.0
 2015-08-25   43.240002   40.389999   42.570000   40.470001  70616600.0
 2015-08-26   42.840000   41.060001   42.009998   42.709999  63408000.0
 2015-08-27   43.950001   42.930000   43.230000   43.900002  50943200.0
 2015-08-28   44.150002   43.389999   43.400002   43.930000  28246700.0
 2015-08-31   43.930000   43.099998   43.560001   43.520000  34441700.0
 2015-09-01   42.590000   41.660000   42.169998   41.820000  49688900.0
 2015-09-02   43.380001   41.880001   42.360001   43.360001  37671500.0
 2015-09-03   43.980000   43.279999   43.410000   43.500000  28285200.0
 2015-09-04   43.040001   42.200001   42.810001   42.610001  37138800.0
 2015-09-08   44.000000   43.200001   43.299999   43.889999  32469800.0
 2015-09-09   44.400002   42.910000   44.209999   43.070000  33469500.0
 2015-09-10   43.790001   42.750000   43.119999   43.290001  31366600.0
 2015-09-11   43.590000   42.939999   43.139999   43.480000  27132500.0
 2015-09-14   43.439999   42.860001   43.430000   43.040001  23656000.0
 2015-09-15   44.290001   43.080002   43.189999   43.980000  28882200.0
 2015-09-16   44.380001   43.840000   43.970001   44.299999  23372200.0
 2015-09-17   45.000000   44.080002   44.290001   44.250000  32768200.0
 2015-09-18   43.990002   43.330002   43.500000   43.480000  63143700.0
 2015-09-21   44.470001   43.599998   43.619999   44.110001  26177200.0
 ...                ...         ...         ...         ...         ...
 2020-06-26  199.889999  194.880005  199.729996  196.330002  54675800.0
 2020-06-29  198.529999  193.550003  195.779999  198.440002  26701600.0
 2020-06-30  204.399994  197.740005  197.880005  203.509995  34310300.0
 2020-07-01  206.350006  201.770004  203.139999  204.699997  32061200.0
 2020-07-02  208.020004  205.000000  205.679993  206.259995  29315800.0
 2020-07-06  211.130005  208.089996  208.830002  210.699997  31897600.0
 2020-07-07  214.669998  207.990005  210.449997  208.250000  33600700.0
 2020-07-08  213.259995  208.690002  210.070007  212.830002  33600000.0
 2020-07-09  216.380005  211.470001  216.330002  214.320007  33121700.0
 2020-07-10  214.080002  211.080002  213.619995  213.669998  26177600.0
 2020-07-13  215.800003  206.500000  214.479996  207.070007  38135600.0
 2020-07-14  208.850006  202.029999  206.130005  208.350006  37591800.0
 2020-07-15  211.330002  205.029999  209.559998  208.039993  32179400.0
 2020-07-16  205.699997  202.309998  205.399994  203.919998  29940700.0
 2020-07-17  205.039993  201.389999  204.470001  202.880005  31635300.0
 2020-07-20  212.300003  203.009995  205.000000  211.600006  36884800.0
 2020-07-21  213.940002  208.029999  213.660004  208.750000  38105800.0
 2020-07-22  212.300003  208.389999  209.199997  211.750000  49605700.0
 2020-07-23  210.919998  202.149994  207.190002  202.539993  67457000.0
 2020-07-24  202.860001  197.509995  200.419998  201.300003  39827000.0
 2020-07-27  203.970001  200.860001  201.470001  203.850006  30160900.0
 2020-07-28  204.699997  201.740005  203.610001  202.020004  23251400.0
 2020-07-29  204.649994  202.009995  202.500000  204.059998  19632600.0
 2020-07-30  204.460007  199.570007  201.000000  203.899994  25079600.0
 2020-07-31  205.100006  199.009995  204.399994  205.009995  51248000.0
 2020-08-03  217.639999  210.440002  211.520004  216.539993  78983000.0
 2020-08-04  214.770004  210.309998  214.169998  213.289993  49280100.0
 2020-08-05  215.000000  211.570007  214.899994  212.940002  28858600.0
 2020-08-06  216.369995  211.550003  212.339996  216.350006  32656800.0
 2020-08-07  215.699997  210.929993  214.850006  212.479996  27789600.0

              Adj Close
 Date
 2015-08-10   42.834789
 2015-08-11   42.002174
 2015-08-12   42.300831
 2015-08-13   42.291790
 2015-08-14   42.536140
 2015-08-17   42.825741
 2015-08-18   43.062599
 2015-08-19   42.461342
 2015-08-20   41.595905
 2015-08-21   39.236439
 2015-08-24   37.970146
 2015-08-25   36.867855
 2015-08-26   38.908478
 2015-08-27   39.992554
 2015-08-28   40.019890
 2015-08-31   39.646370
 2015-09-01   38.097694
 2015-09-02   39.500618
 2015-09-03   39.628151
 2015-09-04   38.817383
 2015-09-08   39.983444
 2015-09-09   39.236439
 2015-09-10   39.436848
 2015-09-11   39.609943
 2015-09-14   39.209103
 2015-09-15   40.065434
 2015-09-16   40.356953
 2015-09-17   40.311398
 2015-09-18   39.609943
 2015-09-21   40.183865
 ...                ...
 2020-06-26  196.330002
 2020-06-29  198.440002
 2020-06-30  203.509995
 2020-07-01  204.699997
 2020-07-02  206.259995
 2020-07-06  210.699997
 2020-07-07  208.250000
 2020-07-08  212.830002
 2020-07-09  214.320007
 2020-07-10  213.669998
 2020-07-13  207.070007
 2020-07-14  208.350006
 2020-07-15  208.039993
 2020-07-16  203.919998
 2020-07-17  202.880005
 2020-07-20  211.600006
 2020-07-21  208.750000
 2020-07-22  211.750000
 2020-07-23  202.539993
 2020-07-24  201.300003
 2020-07-27  203.850006
 2020-07-28  202.020004
 2020-07-29  204.059998
 2020-07-30  203.899994
 2020-07-31  205.009995
 2020-08-03  216.539993
 2020-08-04  213.289993
 2020-08-05  212.940002
 2020-08-06  216.350006
 2020-08-07  212.479996

 [1259 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close   Volume  \
 Date
 2015-08-10   643.440002   631.249023   639.479980   633.729980  1809200
 2015-08-11   674.900024   654.270020   669.200012   660.780029  5029200
 2015-08-12   665.000000   652.289978   663.080017   659.559998  2936700
 2015-08-13   664.500000   651.661011   659.322021   656.450012  1810700
 2015-08-14   659.854980   652.659973   655.010010   657.119995  1072100
 2015-08-17   661.380005   651.239990   656.799988   660.869995  1051700
 2015-08-18   664.000000   653.460022   661.900024   656.130005  1456100
 2015-08-19   667.000000   654.190002   656.599976   660.900024  2134100
 2015-08-20   662.989990   642.900024   655.460022   646.830017  2855300
 2015-08-21   640.049988   612.330017   639.780029   612.479980  4265200
 2015-08-24   599.330017   565.049988   573.000000   589.609985  5770300
 2015-08-25   617.450012   581.109985   614.909973   582.059998  3538000
 2015-08-26   631.710022   599.049988   610.349976   628.619995  4235900
 2015-08-27   643.590027   622.000000   639.400024   637.609985  3491300
 2015-08-28   636.880005   624.559998   632.820007   630.380005  1978700
 2015-08-31   635.799988   617.679993   627.539978   618.250000  2176700
 2015-09-01   612.859985   594.099976   602.359985   597.789978  3702100
 2015-09-02   614.340027   599.710022   605.590027   614.340027  2575600
 2015-09-03   619.710022   602.820984   617.000000   606.250000  1759600
 2015-09-04   603.469971   595.250000   600.000000   600.700012  2089000
 2015-09-08   616.309998   604.119995   612.489990   614.659973  2279500
 2015-09-09   626.520020   609.599976   621.219971   612.719971  1702100
 2015-09-10   624.159973   611.429993   613.099976   621.349976  1905300
 2015-09-11   625.780029   617.419983   619.750000   625.770020  1373500
 2015-09-14   625.859985   619.429993   625.700012   623.239990  1702300

In [275]:
price = pd.DataFrame({ticker: data['Adj Close'] for ticker,data in all_data.items()})

In [279]:
volume = pd.DataFrame({ticker: data['Volume'] for ticker,data in all_data.items()})

I now compute percent changes of the prices, a time series operation which will be
explored further in Chapter 11:

In [280]:
returns = price.pct_change()

In [281]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-08-03  0.025198  0.011144  0.056241 -0.005739
2020-08-04  0.006678  0.012308 -0.015009 -0.006430
2020-08-05  0.003625 -0.003099 -0.001641  0.005898
2020-08-06  0.034889  0.005341  0.016014  0.017976
2020-08-07 -0.022736  0.003775 -0.017888 -0.003740

The corr method of Series computes the correlation of the overlapping, non-NA,
aligned-by-index values in two Series. Relatedly, cov computes the covariance:

In [282]:
returns['MSFT'].corr(returns['IBM'])

0.5923908243307524

In [283]:
returns['MSFT'].cov(returns['IBM'])

0.00016699744344576313

Since MSFT is a valid Python attribute, we can also select these columns using more
concise syntax:

In [284]:
returns.MSFT.corr(returns.IBM)

0.5923908243307524

DataFrame’s corr and cov methods, on the other hand, return a full correlation or
covariance matrix as a DataFrame, respectively:

In [285]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.518881  0.713080  0.656943
IBM   0.518881  1.000000  0.592391  0.542952
MSFT  0.713080  0.592391  1.000000  0.782229
GOOG  0.656943  0.542952  0.782229  1.000000

In [286]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000342  0.000155  0.000231  0.000203
IBM   0.000155  0.000259  0.000167  0.000146
MSFT  0.000231  0.000167  0.000306  0.000228
GOOG  0.000203  0.000146  0.000228  0.000278

Using DataFrame’s corrwith method, you can compute pairwise correlations
between a DataFrame’s columns or rows with another Series or DataFrame. Passing a
Series returns a Series with the correlation value computed for each column:

In [287]:
returns.corrwith(returns.IBM)

AAPL    0.518881
IBM     1.000000
MSFT    0.592391
GOOG    0.542952
dtype: float64

Passing a DataFrame computes the correlations of matching column names. Here I
compute correlations of percent changes with volume:

In [288]:
returns.corrwith(volume)

AAPL   -0.107650
IBM    -0.103749
MSFT   -0.058752
GOOG   -0.146791
dtype: float64

Passing axis='columns' does things row-by-row instead. In all cases, the data points
are aligned by label before the correlation is computed.

### Unique Values, Value Counts, and Membership

Another class of related methods extracts information about the values contained in a
one-dimensional Series. To illustrate these, consider this example:

In [289]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

The first function is unique, which gives you an array of the unique values in a Series:

In [290]:
uniques = obj.unique()

In [291]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

The unique values are not necessarily returned in sorted order, but could be sorted
after the fact if needed (uniques.sort()). Relatedly, value_counts computes a Series
containing value frequencies:

In [292]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

The Series is sorted by value in descending order as a convenience. value_counts is
also available as a top-level pandas method that can be used with any array or
sequence:

In [294]:
pd.value_counts(obj.values, sort=False)

d    1
b    2
a    3
c    3
dtype: int64

isin performs a vectorized set membership check and can be useful in filtering a
dataset down to a subset of values in a Series or column in a DataFrame:

In [295]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [296]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [297]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

Related to isin is the Index.get_indexer method, which gives you an index array
from an array of possibly non-distinct values into another array of distinct values:

In [298]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])

In [299]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

See Table 5-9 for a reference on these methods.

![](val_count.jpg)

In some cases, you may want to compute a histogram on multiple related columns in
a DataFrame. Here’s an example:

In [300]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4], 'Qu2': [2, 3, 1, 2, 3], 'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

Passing pandas.value_counts to this DataFrame’s apply function gives:

In [301]:
result = data.apply(pd.value_counts)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [302]:
result = data.apply(pd.value_counts).fillna(0)

In [303]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

Here, the row labels in the result are the distinct values occurring in all of the col‐
umns. The values are the respective counts of these values in each column.

## 5.4 Conclusion

In the next chapter, we’ll discuss tools for reading (or loading) and writing datasets
with pandas. After that, we’ll dig deeper into data cleaning, wrangling, analysis, and
visualization tools using pandas.